Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

# ?php for( $i=0; $i 100; $i++) {printf("Error $i: %s br ", ldap_err2str($i));}?
source: ?php for( $i=0; $i 100; $i++) {printf("Error $i: %s br \n", ldap_err2str($i));}?
es: ?php for( $i=0; $i 100; $i++) {printf("Error $i: %s br \n", ldap_str2err($i));}?

source: Return the LDAP error number of the last LDAP command for this link.
es: Devuelve el código de error del último comando LDAP para la conexión especificada.

source: This function returns the standardized error number returned by the last LDAP command for the given link_identifier.
es: Esta función devuelve el código numérico de error, que está estandarizado, producido por el último comando LDAP y en la conexión especificada.

source: This number can be converted into a textual error message using ldap_err2str().
es: Este número puede ser convertido en un mensaje textual de error usando ldap_err2str().

source: Unless you lower your warning level in your php.ini sufficiently or prefix your LDAP commands with @ (at) characters to suppress warning output, the errors generated will also show up in your HTML output.
es: A menos que decremente el nivel de alerta en su fichero php3.ini (ó php.ini) o anteponga a los comandos LDAP en símbolo @ (arroba) para suprimir las alertas y warnings, los errores producidos serán mostrados automáticamente en el código HTML generado.

source: Generating and catching an error
es: Generando y capturando un error

source: ?php / / This example contains an error, which we will catch. $ld = ldap_connect( "localhost"); $bind = ldap_bind($ld); / / syntax error in filter expression (errno 87), / / must be "objectclass=* "to work. $res = @ldap_search($ld, "o=Myorg, c=DE", "objectclass"); if (!$res) {printf("LDAP-Errno: %s br \n", ldap_errno($ld)); printf("LDAP-Error: %s br \n", ldap_error($ld)); die("Argh! br \n");} $info = ldap_get_entries($ld, $res); printf("%d matching entries. br \n", $info["count"]);?
es: Debería ser "objectclass=*". $res = @ldap_search($ld, "o=Mi Compañía, c=ES", "objectclass"); if (!$res) {printf("LDAP-Código Error: %s br \n", ldap_errno($ld)); printf("LDAP-Mensaje Error: %s br \n", ldap_error($ld)); die("Argh! br \n");} $info = ldap_get_entries($ld, $res); printf("%d entradas encontradas. br \n", $info["count"]);?

source: See also ldap_err2str() and ldap_error().
es: Ver también ldap_err2str() y ldap_error().

source: This function returns the string error message explaining the error generated by the last LDAP command for the given link_identifier This function returns the string error message explaining the error generated by the last LDAP command for the given link_identifier While LDAP errno numbers are standardized, different libraries return different or even localized textual error messages.
es: Aunque los códigos de error LDAP están estandarizados, diferentes librerías devuelven mensajes textuales de error diferentes o incluso localizados.

source: See also ldap_err2str() and ldap_errno().
es: Ver también ldap_err2str() y ldap_errno().

source: ldap_explode_dn() function is used to split the DN returned by ldap_get_dn() and breaks it up into its component parts.
es: La función ldap_explode_dn() es usada para dividir un DN devuelto por ldap_get_dn() en las partes que le componen.

source: Each part is known as Relative Distinguished Name, or RDN. ldap_explode_dn() returns an array of all those components. with_attrib is used to request if the RDNs are returned with only values or their attributes as well.
es: Cada parte es conocida como Relative Distinguished Name (Nombre Relativo Distinguible) abreviado como RDN. ldap_explode_dn() devuelve un array con todos esos componentes. con_atributos sirve para especificar si los RDN se devuelven sólo como valores o con sus atributos también (es decir, en un formato atributo=valor).

source: To get RDNs with the attributes (i.e. in attribute=value format) set with_attrib to 0 and to get only values set it to 1.
es: Hay que poner with_attrib a 0 para obtener también los atributos y a 1 para obtener sólo los valores.

source: Returns the first attribute in the entry on success and FALSE on error.
es: Devuelte el primer atributo en la entrada o falso si ocurre algún error.

source: Remaining attributes are retrieved by calling ldap_next_attribute() successively. ber_identifier is the identifier to internal memory location pointer.
es: El parámetro indetificador_ber es el identificador del puntero interno a memoria.

source: It is passed by reference.
es: Es pasado por referencia.

source: The same ber_identifier is passed to the ldap_next_attribute() function, which modifies that pointer.
es: El mismo indetificador_ber es pasado a la función ldap_next_attribute() que modifica dicho puntero.

source: See also ldap_get_attributes()
es: Ver también ldap_get_attributes()

source: Returns the result entry identifier for the first entry on success and FALSE on error.
es: Devuelve el identificador de la primera entrada del resultado ó falso en caso de error.

source: Entries in the LDAP result are read sequentially using the ldap_first_entry() and ldap_next_entry() functions. ldap_first_entry() returns the entry identifier for first entry in the result.
es: Las entradas en un resultado LDAP son leidas secuencialmente usando las funciones ldap_first_entry() y ldap_next_entry(). ldap_first_entry() devuelve el identificador de la primera entrada del resultado.

source: This entry identifier is then supplied to ldap_next_entry() routine to get successive entries from the result.
es: Este identificador es entonces suministrado a la rutina lap_next_entry() pata obtener sucesivas entradas del resultado.

source: See also ldap_get_entries().
es: Ver también ldap_get_entries().

source: ldap_free_result() frees up the memory allocated internally to store the result and pointed by the result_identifier.
es: ldap_free_result() libera la memoria reservada internamente para almacenar el resultado de búsquedas LDAP asociada al identificador identificador_de_resultado.

source: All result memory will be automatically freed when the script terminates.
es: Toda la memoria de resultados es automáticamente liberada al finalizarse la ejecución de un script.

source: Typically all the memory allocated for the ldap result gets freed at the end of the script.
es: Normalmente la memoria reservada para resultados ldap se libera al final del script.

source: In case the script is making successive searches which return large result sets, ldap_free_result() could be called to keep the runtime memory usage by the script low.
es: En caso de que el script realice sucesivas búsquedas que devuelvan conjuntos de resultados grandes, puede utilizarse ldap_free_result() para mantener bajo el uso de memoria del script durante su ejecución.

source: Returns a complete entry information in a multi-dimensional array on success and FALSE on error.
es: Devuelve una completa información de la entrada en un array multidimensional o falso en caso de error.

source: ldap_get_attributes() function is used to simplify reading the attributes and values from an entry in the search result.
es: La función ldap_get_attributes() La función ldap_get_attributes() es usada para simplificar el leer atributos y valores de una entrada de un resultado de búsqueda.

source: The return value is a multi-dimensional array of attributes and values.
es: El valor de retorno es un array multidimensional de atributos y sus valores.

source: Having located a specific entry in the directory, you can find out what information is held for that entry by using this call.
es: Teniendo localizado una entrada específica en el directorio se puede conseguir la información que contiene dicha entrada usando esta llamada.

source: You would use this call for an application which "browses" directory entries and / or where you do not know the structure of the directory entries.
es: Puede usar esta función para aplicaciones que naveguen por las entradas del directorio y / o cuando no se conoce la estructura de las entradas del directorio.

source: In many applications you will be searching for a specific attribute such as an email address or a surname, and won 't care what other data is held.
es: En otras aplicaciones se busca un atributo específico, como la dirección de email o los apellidos y no importa el resto de información contenida..

source: return_value[ "count"] = number of attributes in the entry return_value[0] = first attribute return_value[n] = nth attribute return_value["attribute"]["count"] = number of values for attribute return_value["attribute"][0] = first value of the attribute return_value["attribute"][i] = (i+1 )th value of the attribute
es: valor_devuelto[ "count"] = número de atributos en la entrada valor_devuelto[0] = primer atributo valor_devuelto[n] = enésimo atributo valor_devuelto["atributo"]["count"] = número de vaslores del atributo valor_devuelto["atributo"][0] = primer valor del atributo valor_devuelto["atributo"][i] = iésimo valor del atributo

source: Show the list of attributes held for a particular directory entry
es: Mostrar la lista de atributos contenida en una entrada específica de un directorio

source: / / $ds is the link identifier for the directory / / $sr is a valid search result from a prior call to / / one of the ldap directory search calls $entry = ldap_first_entry( $ds, $sr); $attrs = ldap_get_attributes($ds, $entry); echo $attrs["count"]. "attributes held for this entry: p"; for ($i=0; $i $attrs["count"]; $i++) echo $attrs[$i]. "br";
es: / / $ds es un identificador de conexión al directorio / / $sr es un resultado de búsqueda válido de una llamada / / anterior a una de las funciones de búsqueda en directorios / / ldap. $entrada = ldap_first_entry( $ds, $sr); $atributos = ldap_get_attributes($ds, $entrada); echo $atributos["count"]. "atributos contenidos en esta entrada: p"; for ($i=0; $i $atributos["count"]; $i++) echo $atributos[$i]. "br";

source: See also ldap_first_attribute() and ldap_next_attribute()
es: Ver también ldap_first_attribute() y ldap_next_attribute()

source: Returns the DN of the result entry and FALSE on error.
es: Devuelve el DN de la entrada del resultado o falso en caso de error.

source: ldap_get_dn() function is used to find out the DN of an entry in the result.
es: La función ldap_get_dn() se utiliza para obtener el DN de una entrada de un resultado de búsqueda.

source: Returns a complete result information in a multi-dimenasional array on success and FALSE on error.
es: Devuelve una completa información de un resultado de búsqueda en un array multidimensional o falso en caso de error.

source: ldap_get_entries() function is used to simplify reading multiple entries from the result, specified with result_identifier, and then reading the attributes and multiple values.
es: La función ldap_get_entries() es usada para simplificar el leer múltiples entradas de de un resultado y después leer sus atributos y multiples valores.

source: The entire information is returned by one function call in a multi-dimensional array.
es: Toda la información es devuelta por una llamada a una función en forma de array multidimensional.

source: The structure of the array is as follows.
es: La estructura del array es como se muestra más abajo.

source: The attribute index is converted to lowercase. (Attributes are case-insensitive for directory servers, but not when used as array indices.)
es: Los indices de atributos son convertidos a minúsculas. (Los atributos de servidores de directorios son indiferentes a las mayusculas / minusculas, pero no cuando son usados como indices de arrays)

source: return_value[ "count"] = number of entries in the result return_value[0]: refers to the details of first entry return_value[i]["dn"] = DN of the ith entry in the result return_value[i]["count"] = number of attributes in ith entry return_value[i][j] = jth attribute in the ith entry in the result return_value[i]["attribute"]["count"] = number of values for attribute in ith entry return_value[i]["attribute"][j] = jth value of attribute in ith entry
es: valor_devuelto[ "count"] = número de entradas del resultado valor_devuelto[0]: contiene los detalles de la primera entrada valor_devuelto[i]["dn"] = DN de la entrada iésima del resultado valor_devuelto[i]["count"] = número de atributos de la entrada iésima valor_devuelto[i][j] = jésimo atributo de la iésima entrada del resultado valor_devuelto[i]["atributo"]["count"] = número de valores para "atributo "en la entrada iésima valor_devuelto[i]["atributo"][j] = jésimo valor de "atributo" en la entrada iésima

source: See also ldap_first_entry() and ldap_next_entry()
es: Ver también ldap_first_entry() y ldap_next_entry()

source: Returns an array of values for the attribute on success and FALSE on error.
es: Devuelve un array de valores del atributo o falso en caso de error.

source: ldap_get_values() function is used to read all the values of the attribute in the entry in the result. entry is specified by the result_entry_identifier.
es: La entrada del resultado es especificada por el identificador_de_entrada_de_resultado.

source: The number of values can be found by indexing "count" in the resultant array.
es: El número de valores se almacena en el índice "count" del array devuelto.

source: Individual values are accessed by integer index in the array.
es: Los valores individuales se almacenan con índices enteros en el array.

source: The first index is 0.
es: El primer índice es 0.

source: This call needs a result_entry_identifier, so needs to be preceded by one of the ldap search calls and one of the calls to get an individual entry.
es: Esta llamada necesita un identificador_de_entrada_de_resultado, por lo que necesita ser precedida por una de las llamadas de búsqueda ldap y una llamada para obtener una entrada en particular del resultado.

source: You application will either be hard coded to look for certain attributes (such as "surname "or "mail") or you will have to use the ldap_get_attributes() call to work out what attributes exist for a given entry.
es: La aplicación debe ser o bien programada específicamente para buscar ciertos atributos (como apellidos o email) o bien utilizar la función ldap_get_attributes() para averiguar que atributos existen para una entrada dada, antes de llamar a ldap_get_values().

source: LDAP allows more than one entry for an attribute, so it can, for example, store a number of email addresses for one person' s directory entry all labeled with the attribute "mail "
es: LDAP permite mas de un valor para cada atributo, por lo que se puede, por ejemplo, almacenar varias direcciones de email para una persona en el directorio y nombrar a ese atributo como "email"

source: return_value[ "count"] = number of values for attribute return_value[0] = first value of attribute return_value[i] = ith value of attribute
es: valor_devuelto[ "count"] = número de valores del atributo valor_devuelto[0] = primer valor del atributo valor_devuelto[i] = iésimo valor del atributo

source: List all values of the "mail" attribute for a directory entry
es: Listar todos los valores del atributo "email" de una entrada de un directorio

source: / / $ds is a valid link identifier for a directory server / / $sr is a valid search result from a prior call to / / one of the ldap directory search calls / / $entry is a valid entry identifier from a prior call to / / one of the calls that returns a directory entry $values = ldap_get_values( $ds, $entry ,"mail"); echo $values["count"]. "email addresses for this entry. p"; for ($i=0; $i $values["count"]; $i++) echo $values[$i]. "br";
es: / / $ds es un identificador de conexión al directorio / / $sr es un resultado de búsqueda válido de una llamada / / anterior a una de las funciones de búsqueda en directorios / / ldap. / / $entrada es un identificador de entrada válido de una llamada / / anterior a una de las funciones que devuelven una entrada de / / directorio $valores = ldap_get_values( $ds, $entrada ,"email"); echo $valores["count"]. "direcciones de email para esta entrada. p"; for ($i=0; $i $valores["count"]; $i++) echo $valores[$i]. "br";

source: ldap_get_values_len() function is used to read all the values of the attribute in the entry in the result. entry is specified by the result_entry_identifier.
es: La función ldap_get_values_len() La función ldap_get_values_len() se utiliza para obtener todos los valores de un atributo de una entrada de un resultado de búsqueda.

source: This function is used exactly like ldap_get_values() except that it handles binary data and not string data.
es: El primer índice es 0.

source: This function was added in 4.0.
es: Esta función se utiliza exactamente como ldap_get_values() salvo que permite manejar datos binarios y no cadenas de caracteres.

source: Returns a search result identifier or FALSE on error.
es: Devuelve un identificador de resultado de búsqueda o falso en caso de error.

source: ldap_list() performs the search for a specified filter on the directory with the scope LDAP_SCOPE_ONELEVEL.
es: ldap_list() realiza la búsqueda según el filtro especificado en el directorio con el alcance LDAP_SCOPE_ONELEVEL.

source: This call takes 5 optional parameters.
es: LDAP_SCOPE_ONELEVEL significa que la búsqueda solo devuelve información que se encuentre en el nivel inmediatamente inferior al dn_base especificado en la llamada a la función. (Equivalente a ejecutar "ls "en un unix y obtener un listado de ficheros y carpetas en el directorio de trabajo actual.)

source: These optional parameters were added in 4.0.2: attrsonly, sizelimit, timelimit, deref.
es: Consulte las notas de la función ldap_search().

source: Produce a list of all organizational units of an organization
es: Produce una lista de todas las unidades organizativas de una compañía

source: This function adds attribute( s) to the specified dn.
es: Esta función añadir uno o varios atributos al dn especificado.

source: It performs the modification at the attribute level as opposed to the object level.
es: Realiza la modificación al nivel de atributos, en vez de hacerlo al nivel de objetos.

source: Object-level additions are done by the ldap_add() function.
es: Las modificaciones a nivel de objeto son propocionadas por la función ldap_add().

source: This function removes attribute( s) from the specified dn.
es: Esta función elimina atributos del dn especificado.

source: Object-level deletions are done by the ldap_delete() function.
es: Las modificaciones a nivel de objeto son proporcionadas por la función ldap_del().

source: ldap_modify() function is used to modify the existing entries in the LDAP directory.
es: La función ldap_modify() se utiliza para modificar entradas existentes en un directorio LDAP.

source: The structure of the entry is same as in ldap_add().
es: La estructura de la entrada es igual a la de ldap_add().

source: This function replaces attribute( s) from the specified dn.
es: Esta función reemplaza atributos del dn especificado.

source: Object-level modifications are done by the ldap_modify() function.
es: Las modificaciones a nivel de objeto son proporcionadas por la función ldap_modify().

source: Returns the next attribute in an entry on success and FALSE on error.
es: Devuelve el siguiente atributo de una entrada o falso en caso de error.

source: ldap_next_attribute() is called to retrieve the attributes in an entry.
es: ldap_next_attribute() es llamado para recuperar los atributos de una entrada.

source: It is passed by reference to the function.
es: El estado interno del puntero es mantenido por el identificador_ber, que es pasado por referencia a la función.

source: The first call to ldap_next_attribute() is made with the result_entry_identifier returned from ldap_first_attribute().
es: La primera llamada a ldap_next_attribute() es realizada con el identificador_de_entrada_de_resultado devuelto por la función ldap_first_attribute().

source: Returns entry identifier for the next entry in the result whose entries are being read starting with ldap_first_entry().
es: Las entradas deben haber sido leidas al principio con ldap_first_entry().

source: If there are no more entries in the result then it returns FALSE.
es: Si no hay más entradas en el resultado devuelve falso.

source: ldap_next_entry() function is used to retrieve the entries stored in the result.
es: La función ldap_next_entry() se utiliza para obtener las entradas almacenadas en un resultado.

source: Successive calls to the ldap_next_entry() return entries one by one till there are no more entries.
es: Llamadas sucesivas a la función ldap_next_entry() devuelven las entradas una a una hasta que ya no queden más entradas.

source: The first call to ldap_next_entry() is made after the call to ldap_first_entry() with the result_entry_identifier as returned from the ldap_first_entry().
es: La primera llamada a ldap_next_entry() se realiza después de llamar a ldap_first_entry().

source: See also ldap_get_entries()
es: Ver también ldap_get_entries()

source: So it is equivalent to reading an entry from the directory.
es: ldap_read() realiza la búsqueda según el filtro especificado con alcance LDAP_SCOPE_BASE, por lo que es equivalente a leer cualquier entrada del directorio.

source: An empty filter is not allowed.
es: No se permiten filtros vacios.

source: If you want to retrieve absolutely all information for this entry, use a filter of "objectClass=*".
es: Si se pretende obtener absolutamente toda la información, se debe usar un filtro del tipo "objectClass=*".

source: See ldap_search() for details.
es: Consulte las notas de la función ldap_search().

source: This is equivalent to searching the entire directory. base_dn specifies the base DN for the directory.
es: Devuelve un identificador de resultado de búsqueda o falso en caso de error.

source: This is much more efficient than the default action (which is to return all attributes and their associated values).
es: ldap_search() realiza la búsqueda según el filtro especificado con alcance LDAP_SCOPE_SUBTREE.

source: The fourth parameter is a standard PHP string array of the required attributes, eg array( "mail" ,"sn" ,"cn") Note that the "dn "is always returned irrespective of which attributes types are requested.
es: Esto es equivalente a buscar en el directorio entero. dn_base especifica el DN base para el directorio.

source: If this occurs, the server will indicate that it has only returned a partial results set.
es: Existe un cuarto parámetro opcional que puede ser añadido para restringir los atributos y valores devueltos por el servidor a sólo los requeridos.

source: The fifth parameter attrsonly should be set to 1 if only attribute types are wanted.
es: Es mucho más eficiente que la acción por defecto (que devolverá todos los atributos y sus valores asociados).

source: With the sixth parameter sizelimit it is possible to limit the count of entries fetched.
es: El uso del cuarto parámetro debe ser por tanto considerado una práctica recomendable.

source: Setting this to 0 means no limit.
es: El cuerto parámetro es un array estándar de PHP con los atributos requeridos, por ejemplo array( "email" ,"sn" ,"cn").

source: It can be one of the following:
es: Nota: "dn" siempre es devuelto independientemente de que tipos de atributos sean solicitados.

source: LDAP_DEREF_SEARCHING - aliases should be dereferenced during the search but not when locating the base object of the search.
es: También es necesario resaltar que algunos servidores de directorio están configurados para devolver un cierto número de entradas como máximo.

source: LDAP_DEREF_ALWAYS - aliases should be dereferenced always.
es: Si esto ocurre, el servidor indicará que solo devuelve un conjunto de resultados parcial.
